songwenshuai/nichestack/ST/BSP/STM32H743ZI_Nucleo/bsp_clk.c
/*
*********************************************************************************************************
*                                            EXAMPLE CODE
*
*               This file is provided as an example on how to use Micrium products.
*
*               Please feel free to use any application code labeled as 'EXAMPLE CODE' in
*               your application products.  Example code may be used as is, in whole or in
*               part, or may be used as a reference only. This file can be modified as
*               required to meet the end-product requirements.
*
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*
*               You can find our product's user manual, API reference, release notes and
*               more information at https://doc.micrium.com.
*               You can contact us at www.micrium.com.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                    MICRIUM BOARD SUPPORT PACKAGE
*                                         STM32H743ZI NUCLEO
*
* Filename : bsp_clk.c
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                            INCLUDE FILES
*********************************************************************************************************
*/

#include  <lib_def.h>
#include  "bsp_clk.h"

#ifdef  CLK_MODULE_PRESENT
#include  <Source/clk.h>
#include  <clk_cfg.h>
#endif

#include  <stm32h7xx_hal.h>


/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                      LOCAL FUNCTION PROTOTYPES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*********************************************************************************************************
*                                          GLOBAL FUNCTIONS
*********************************************************************************************************
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                            BSP_ClkInit()
*
* Description : Initializes the system clock for the kernel.
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Note(s)     : (1) Should be called before OSStart() in main.
*
*               (2) The voltage scaling allows optimizing the power consumption when the device is
*                   clocked below the maximum system frequency, to update the voltage scaling value
*                   regarding system frequency refer to product datasheet.
*********************************************************************************************************
*/

void  BSP_ClkInit (void)
{
    RCC_ClkInitTypeDef  RCC_ClkInit;
    RCC_OscInitTypeDef  RCC_OscInit;
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

    PWR->CR3 &= ~PWR_CR3_SCUEN;                                 /* Supply configuration updated locked.                 */

    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);  /* See Note 2.                                      */

    while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {
        ;
    }
    /* Enable D2 domain SRAM1 Clock (0x30000000 AXI)*/
    __HAL_RCC_D2SRAM1_CLK_ENABLE(); 
    /* Enable D2 domain SRAM3 Clock (0x30040000 AXI)*/
    __HAL_RCC_D2SRAM3_CLK_ENABLE();
                                                                /* Enable HSE Osc and activate PLL with HSE as source   */
    RCC_OscInit.OscillatorType = RCC_OSCILLATORTYPE_HSE;        /* HSE = 8 MHz                                          */
    RCC_OscInit.HSEState       = RCC_HSE_ON;
    RCC_OscInit.HSIState       = RCC_HSI_OFF;
    RCC_OscInit.CSIState       = RCC_CSI_OFF;
    RCC_OscInit.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInit.PLL.PLLSource  = RCC_PLLSOURCE_HSE;

    RCC_OscInit.PLL.PLLM       = 4u;                            /* f(REF_CK)    = HSE / PLLM          = 2MHz            */
    RCC_OscInit.PLL.PLLN       = 400u;                          /* f(VCO clock) = f(REF_CK) * PLLN    = 800MHz          */
    RCC_OscInit.PLL.PLLP       = 2u;                            /* PLL(P CLK)   = f(VCO clock) / PLLR = 400MHz          */
    RCC_OscInit.PLL.PLLR       = 2u;                            /* PLL(R CLK)   = f(VCO clock) / PLLR = 400MHz          */
    RCC_OscInit.PLL.PLLQ       = 4u;                            /* PLL(Q CLK)   = f(VCO clock) / PLLQ = 200MHz          */

    RCC_OscInit.PLL.PLLVCOSEL  = RCC_PLL1VCOWIDE;
    RCC_OscInit.PLL.PLLRGE     = RCC_PLL1VCIRANGE_2;

    if (HAL_RCC_OscConfig(&RCC_OscInit) != HAL_OK) {
        while(1u);                                              /* STOP if error                                        */
    }

                                                                /* ----- CFG SYSCLK SOURCE AND BUS CLOCK DIVIDERS ----- */
    RCC_ClkInit.ClockType      = (RCC_CLOCKTYPE_SYSCLK   |
                                  RCC_CLOCKTYPE_HCLK     |
                                  RCC_CLOCKTYPE_D1PCLK1  |
                                  RCC_CLOCKTYPE_PCLK1    |
                                  RCC_CLOCKTYPE_PCLK2    |
                                  RCC_CLOCKTYPE_D3PCLK1);

    RCC_ClkInit.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;       /* Select PLL as system clock source.                   */
    RCC_ClkInit.SYSCLKDivider  = RCC_SYSCLK_DIV1;               /* SYSCLK  = PLL(P CLK) = 400MHz                        */
    RCC_ClkInit.AHBCLKDivider  = RCC_HCLK_DIV2;                 /* HCLK    = AHBxCLK = SYSCLK / AHBPRES(2) = 200MHz.    */
    RCC_ClkInit.APB3CLKDivider = RCC_APB3_DIV2;                 /* APB3CLK = AHB3CLK / APB3DIV(2)          = 100MHz.    */
    RCC_ClkInit.APB1CLKDivider = RCC_APB1_DIV2;                 /* APB1CLK = AHB1CLK / APB1DIV(2)          = 100MHz.    */
    RCC_ClkInit.APB2CLKDivider = RCC_APB2_DIV2;                 /* APB2CLK = AHB2CLK / APB2DIV(2)          = 100MHz.    */
    RCC_ClkInit.APB4CLKDivider = RCC_APB4_DIV2;                 /* APB2CLK = AHB4CLK / APB4DIV(2)          = 100MHz.    */

    if (HAL_RCC_ClockConfig(&RCC_ClkInit, FLASH_LATENCY_4) != HAL_OK) {
        while(1u);                                              /* STOP if error                                        */
    }
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART3;
    PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
        while(1u);                                              /* STOP if error                                        */
    }
    __HAL_RCC_CSI_ENABLE();                                     /* activate CSI clk mondatory for I/O Compensation Cell */
    __HAL_RCC_SYSCFG_CLK_ENABLE();                              /* Enable SYSCFG clk mondatory for I/O Compensation Cell*/
    HAL_EnableCompensationCell();                               /* Enables the I/O Compensation Cell                    */
}


